// : Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Input number 1");

int number1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Input number 2");

int number2 = Convert.ToInt32(Console.ReadLine());

if (number1 > number2)
{
    Console.WriteLine("max");
    Console.WriteLine(number1);

}

else 
{
    Console.WriteLine("max");
    Console.WriteLine(number2);
}
 